app/views/class1s/show.html.erb


	<% @class1.student2s.each do |stu| %>
---
SELECT "student2s".* FROM "student2s" WHERE "student2s"."class1_id" = ?  [["class1_id", 1]]