app/controllers/class1s_controller.rb

SELECT "class1s".* FROM "class1s"
---
  def index
    @class1s = Class1.all

INSERT INTO "class1s" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "1ban"], ["created_at", "2017-08-07 08:29:34.726196"], ["updated_at", "2017-08-07 08:29:34.726196"]]
---
  def create
    @class1 = Class1.new(class1_params)

    respond_to do |format|
      if @class1.save

UPDATE "class1s" SET "name" = ?, "updated_at" = ? WHERE "class1s"."id" = ?  [["name", "4ban"], ["updated_at", "2017-08-07 11:14:20.434117"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @class1.update(class1_params)

DELETE FROM "class1s" WHERE "class1s"."id" = ?  [["id", 2]]
---
  def destroy
    @class1.destroy

SELECT  "class1s".* FROM "class1s" WHERE "class1s"."id" = ? LIMIT 1  [["id", 4]]
---
    def set_class1
      @class1 = Class1.find(params[:id])