app/controllers/student1s_controller.rb

SELECT "student1s".* FROM "student1s"
---
  def index
    @student1s = Student1.all

INSERT INTO "student1s" ("name", "class1_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "zhangsan"], ["class1_id", 1], ["created_at", "2017-08-07 09:14:12.438699"], ["updated_at", "2017-08-07 09:14:12.438699"]]
---
  def create
    @student1 = Student1.new(student1_params)

    respond_to do |format|
      if @student1.save

SELECT  "student1s".* FROM "student1s" WHERE "student1s"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_student1
      @student1 = Student1.find(params[:id])