app/controllers/student2s_controller.rb

  def index
    @student2s = Student2.all
---
SELECT "student2s".* FROM "student2s"

  def create
    @student2 = Student2.new(student2_params)

    respond_to do |format|
      if @student2.save
---
INSERT INTO "student2s" ("name", "age", "class1_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "zhangsan"], ["age", 12], ["class1_id", 1], ["created_at", "2017-08-07 10:29:13.118379"], ["updated_at", "2017-08-07 10:29:13.118379"]]

  def update
    respond_to do |format|
      if @student2.update(student2_params)
---
UPDATE "student2s" SET "class1_id" = ?, "updated_at" = ? WHERE "student2s"."id" = ?  [["class1_id", 4], ["updated_at", "2017-08-07 11:14:37.516596"], ["id", 3]]

    def set_student2
      @student2 = Student2.find(params[:id])
---
SELECT  "student2s".* FROM "student2s" WHERE "student2s"."id" = ? LIMIT 1  [["id", 3]]